app/views/album/show.html.erb

<div class="container">
	<% @albums.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = $1  [["album_id", 1]]