app/controllers/album_controller.rb

SELECT "albums".* FROM "albums"
---
	def index
		@albums = Album.all

SELECT  "albums".* FROM "albums" WHERE "albums"."album_id" = $1 LIMIT $2  [["album_id", 1], ["LIMIT", 1]]
---
	def show
		@albums = Album.find(params[:id])