app/controllers/blog_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."blog_id" = $1 LIMIT $2  [["blog_id", 1], ["LIMIT", 1]]
---
	def show
		@blogs = Blog.find(params[:id])