app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "user_id"  [["user_name", "syphu"], ["password", "123"], ["email", "syphu@mail.com"], ["created_at", "2017-10-04 09:57:16.897656"], ["updated_at", "2017-10-04 09:57:16.897656"]]
---
  def create
    user = User.create(user_params)