app/views/blog/show.html.erb

								<p style="font-size: 13px;"><%= bcomment.content %></p>
								<p style="font-size: 11px; float: right" class="font-italic">by: <%= User.find_by_user_id(bcomment.user_id).user_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]